//<=============================================================================
//メイン処理(main.h)
//
//Author:kazuki watanabe
//<=============================================================================
#ifndef _MAIN_H_	//このマクロ定義がされていなかったら
#define _MAIN_H_	//二重インクルード防止のマクロを定義する

#include "Including.h"

#define SCREEN_WIDTH		(1280)		//ウインドウの幅
#define SCREEN_HEIGHT		(720)		//ウインドウの高さ
#define MAX_COMMENT			(256)		//コメントの最大数

//<***********************************************************
//グローバル関数
//<***********************************************************
int GetFPS(void);
void SetD_SPEED(void);
void SetS_SPEED(void);

#endif
